# Learning PySpark Yo!

# 19/2/2025

In [77]:
from pyspark.sql import SparkSession

In [85]:
# for stopping session
spark.stop()

In [88]:
spark = SparkSession.builder.appName('Dataframe').getOrCreate()

In [90]:
spark

# Import data

In [91]:
df = spark.read.csv('./DATASET/salary_dataset.csv')

In [92]:
df

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string, _c5: string]

In [93]:
df.show()
# you can see that the columns name are not it

+---+----------+----+---------+----------+------+
|_c0|       _c1| _c2|      _c3|       _c4|   _c5|
+---+----------+----+---------+----------+------+
|age|experience| gpa|   degree|  position|salary|
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [95]:
# set column name to default
# inferSchema = False is consider data as String
df = spark.read.option('header', 'true').csv('./DATASET/salary_dataset.csv', inferSchema = True)
df.show()

+---+----------+----+---------+----------+------+
|age|experience| gpa|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [96]:
type(df)

pyspark.sql.dataframe.DataFrame

In [97]:
# Check schema
df.printSchema()

root
 |-- age: integer (nullable = true)
 |-- experience: integer (nullable = true)
 |-- gpa: double (nullable = true)
 |-- degree: string (nullable = true)
 |-- position: string (nullable = true)
 |-- salary: integer (nullable = true)

In [98]:
df.head(5)

[Row(age=30, experience=7, gpa=3.94, degree='bachelor', position='engineer', salary=32500),
 Row(age=26, experience=2, gpa=2.86, degree='bachelor', position=None, salary=22500),
 Row(age=27, experience=0, gpa=3.13, degree='doctorate', position='secretary', salary=37000),
 Row(age=32, experience=None, gpa=3.1, degree='bachelor', position='engineer', salary=24500),
 Row(age=24, experience=1, gpa=3.81, degree='bachelor', position='accountant', salary=23500)]

In [99]:
df.select(['age', 'gpa']).show(3)

+---+----+
|age| gpa|
+---+----+
| 30|3.94|
| 26|2.86|
| 27|3.13|
+---+----+
only showing top 3 rows

In [100]:
df.dtypes

[('age', 'int'),
 ('experience', 'int'),
 ('gpa', 'double'),
 ('degree', 'string'),
 ('position', 'string'),
 ('salary', 'int')]

In [101]:
df.describe().show()

+-------+-----------------+-----------------+------------------+--------+----------+------------------+
|summary|              age|       experience|               gpa|  degree|  position|            salary|
+-------+-----------------+-----------------+------------------+--------+----------+------------------+
|  count|               89|               89|                90|      90|        89|                89|
|   mean|28.02247191011236|3.808988764044944|3.2634444444444437|    NULL|      NULL|31224.719101123595|
| stddev|4.364051308156759|3.658354089969913|0.5251306121340191|    NULL|      NULL|  9186.51780029839|
|    min|               21|                0|              2.52|bachelor|accountant|             13000|
|    max|               35|               13|              5.88|  master| secretary|             54000|
+-------+-----------------+-----------------+------------------+--------+----------+------------------+

In [108]:
# add columns in df
df = df.withColumn('salary x2', df['salary'] * 2)
df.show()

+---+----------+----+---------+----------+------+---------+
|age|experience| gpa|   degree|  position|salary|salary x2|
+---+----------+----+---------+----------+------+---------+
| 30|         7|3.94| bachelor|  engineer| 32500|    65000|
| 26|         2|2.86| bachelor|      NULL| 22500|    45000|
| 27|         0|3.13|doctorate| secretary| 37000|    74000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|    49000|
| 24|         1|3.81| bachelor|accountant| 23500|    47000|
| 35|         7|3.93|doctorate| secretary| 43500|    87000|
| 23|         1|3.78|   master|accountant| 30500|    61000|
| 32|         8|3.04| bachelor|accountant| 31500|    63000|
| 27|         2|3.52| bachelor| secretary| 18500|    37000|
| 35|        11|3.66|doctorate|accountant| 54000|   108000|
| 33|         4|2.59| bachelor| secretary| 26000|    52000|
| 25|         3|3.81| bachelor| secretary| 17000|    34000|
| 30|         4|3.17| bachelor|accountant| 23000|    46000|
| 22|         1|3.66| bachelor| secretary| 24000|    48000|
| 25|         0|3.65| bachelor|  engineer| 27500|    55000|
| 28|         4| 3.1|   master|  engineer| 37000|    74000|
| 24|         0|3.05|   master| secretary| 28500|    57000|
| 33|         3|3.34|doctorate|  engineer| 44000|    88000|
| 31|         0|2.65| bachelor|accountant| 24000|    48000|
| 25|         4| 2.8|   master|accountant| 27500|    55000|
+---+----------+----+---------+----------+------+---------+
only showing top 20 rows

In [111]:
# drop column
df = df.drop('salary x2')
df.show()

+---+----------+----+---------+----------+------+
|age|experience| gpa|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [113]:
# rename columns
df = df.withColumnRenamed('gpa','GPA')
df.show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

# Handling Missing Values

In [114]:
# drop na
df.na.drop().show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
| 23|         1|2.54|   master| secretary| 23000|
| 29|         7|3.52|   master|accountant| 33500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [116]:
# any == how
# drop row that has all NULL
df.na.drop(how='all').show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [118]:
# all == how
# drop row that has a NULL
df.na.drop(how='any').show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
| 23|         1|2.54|   master| secretary| 23000|
| 29|         7|3.52|   master|accountant| 33500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [119]:
# threshold
df.na.drop(how='any', thresh=2).show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [122]:
#subset
df.na.drop(how='any', subset=['position']).show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
| 23|         1|2.54|   master| secretary| 23000|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [130]:
# filling missing values
df.na.fill('MISSING', ['position']).show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|   MISSING| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|
| 24|         1|3.81| bachelor|accountant| 23500|
| 35|         7|3.93|doctorate| secretary| 43500|
| 23|         1|3.78|   master|accountant| 30500|
| 32|         8|3.04| bachelor|accountant| 31500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 35|        11|3.66|doctorate|accountant| 54000|
| 33|         4|2.59| bachelor| secretary| 26000|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 33|         3|3.34|doctorate|  engineer| 44000|
| 31|         0|2.65| bachelor|accountant| 24000|
| 25|         4| 2.8|   master|accountant| 27500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [131]:
# imputer
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age', 'experience', 'salary'],
    outputCols=['{}_imputed'.format(c) for c in ['age', 'experience', 'salary'] ]
).setStrategy('mean')

In [132]:
# add imputer to df
imputer.fit(df).transform(df).show()

+---+----------+----+---------+----------+------+-----------+------------------+--------------+
|age|experience| GPA|   degree|  position|salary|age_imputed|experience_imputed|salary_imputed|
+---+----------+----+---------+----------+------+-----------+------------------+--------------+
| 30|         7|3.94| bachelor|  engineer| 32500|         30|                 7|         32500|
| 26|         2|2.86| bachelor|      NULL| 22500|         26|                 2|         22500|
| 27|         0|3.13|doctorate| secretary| 37000|         27|                 0|         37000|
| 32|      NULL| 3.1| bachelor|  engineer| 24500|         32|                 3|         24500|
| 24|         1|3.81| bachelor|accountant| 23500|         24|                 1|         23500|
| 35|         7|3.93|doctorate| secretary| 43500|         35|                 7|         43500|
| 23|         1|3.78|   master|accountant| 30500|         23|                 1|         30500|
| 32|         8|3.04| bachelor|accountant| 31500|         32|                 8|         31500|
| 27|         2|3.52| bachelor| secretary| 18500|         27|                 2|         18500|
| 35|        11|3.66|doctorate|accountant| 54000|         35|                11|         54000|
| 33|         4|2.59| bachelor| secretary| 26000|         33|                 4|         26000|
| 25|         3|3.81| bachelor| secretary| 17000|         25|                 3|         17000|
| 30|         4|3.17| bachelor|accountant| 23000|         30|                 4|         23000|
| 22|         1|3.66| bachelor| secretary| 24000|         22|                 1|         24000|
| 25|         0|3.65| bachelor|  engineer| 27500|         25|                 0|         27500|
| 28|         4| 3.1|   master|  engineer| 37000|         28|                 4|         37000|
| 24|         0|3.05|   master| secretary| 28500|         24|                 0|         28500|
| 33|         3|3.34|doctorate|  engineer| 44000|         33|                 3|         44000|
| 31|         0|2.65| bachelor|accountant| 24000|         31|                 0|         24000|
| 25|         4| 2.8|   master|accountant| 27500|         25|                 4|         27500|
+---+----------+----+---------+----------+------+-----------+------------------+--------------+
only showing top 20 rows

# Filter Operation

In [133]:
# age less than 30
df.filter('age<=30').show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 24|         1|3.81| bachelor|accountant| 23500|
| 23|         1|3.78|   master|accountant| 30500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 25|         4| 2.8|   master|accountant| 27500|
| 23|         1|2.54|   master| secretary| 23000|
| 29|         7|3.52|   master|accountant| 33500|
| 29|         2|3.77| bachelor| secretary| 22000|
| 22|         1|2.56| bachelor|  engineer| 24500|
| 27|         2|2.74|doctorate|  engineer| 34000|
| 26|         0|2.82|   master|  engineer| 33000|
| 21|         0|2.59| bachelor|accountant| 21500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

In [135]:
# show position that age less than 30
df.filter('age<=30').select(['position']).show()

+----------+
|  position|
+----------+
|  engineer|
|      NULL|
| secretary|
|accountant|
|accountant|
| secretary|
| secretary|
|accountant|
| secretary|
|  engineer|
|  engineer|
| secretary|
|accountant|
| secretary|
|accountant|
| secretary|
|  engineer|
|  engineer|
|  engineer|
|accountant|
+----------+
only showing top 20 rows

In [136]:
df.filter(df['salary'] <= 20000).show()

+---+----------+----+--------+---------+------+
|age|experience| GPA|  degree| position|salary|
+---+----------+----+--------+---------+------+
| 27|         2|3.52|bachelor|secretary| 18500|
| 25|         3|3.81|bachelor|secretary| 17000|
| 25|         0|2.59|bachelor|secretary| 13000|
| 21|         0|3.37|bachelor|secretary| 17000|
| 22|         0|3.49|bachelor| engineer| 19000|
| 22|         0|3.17|bachelor|secretary| 19000|
| 21|         0|3.24|bachelor|secretary| 15000|
+---+----------+----+--------+---------+------+

In [146]:
df.filter((df['salary'] >= 10000) & (df['age'] <= 30)).show()

+---+----------+----+---------+----------+------+
|age|experience| GPA|   degree|  position|salary|
+---+----------+----+---------+----------+------+
| 30|         7|3.94| bachelor|  engineer| 32500|
| 26|         2|2.86| bachelor|      NULL| 22500|
| 27|         0|3.13|doctorate| secretary| 37000|
| 24|         1|3.81| bachelor|accountant| 23500|
| 23|         1|3.78|   master|accountant| 30500|
| 27|         2|3.52| bachelor| secretary| 18500|
| 25|         3|3.81| bachelor| secretary| 17000|
| 30|         4|3.17| bachelor|accountant| 23000|
| 22|         1|3.66| bachelor| secretary| 24000|
| 25|         0|3.65| bachelor|  engineer| 27500|
| 28|         4| 3.1|   master|  engineer| 37000|
| 24|         0|3.05|   master| secretary| 28500|
| 25|         4| 2.8|   master|accountant| 27500|
| 23|         1|2.54|   master| secretary| 23000|
| 29|         7|3.52|   master|accountant| 33500|
| 29|         2|3.77| bachelor| secretary| 22000|
| 22|         1|2.56| bachelor|  engineer| 24500|
| 27|         2|2.74|doctorate|  engineer| 34000|
| 26|         0|2.82|   master|  engineer| 33000|
| 21|         0|2.59| bachelor|accountant| 21500|
+---+----------+----+---------+----------+------+
only showing top 20 rows

# Group by and aggregate functions

In [165]:
# group by
# group to find the maximum salary
df.groupBy('position').max().show()

+----------+--------+---------------+--------+-----------+
|  position|max(age)|max(experience)|max(GPA)|max(salary)|
+----------+--------+---------------+--------+-----------+
|      NULL|      26|              2|    2.86|      22500|
|accountant|      35|             11|    3.88|      54000|
| secretary|      35|             12|    5.88|      48500|
|  engineer|      35|             13|    3.94|      53000|
+----------+--------+---------------+--------+-----------+

In [162]:
# groupby degree to find mean of age
df.groupBy('degree').mean().show()

+---------+------------------+-----------------+------------------+------------------+
|   degree|          avg(age)|  avg(experience)|          avg(GPA)|       avg(salary)|
+---------+------------------+-----------------+------------------+------------------+
|doctorate| 31.22222222222222|6.421052631578948|3.2421052631578946| 43868.42105263158|
|   master|27.727272727272727|3.212121212121212| 3.294545454545455|31530.303030303032|
| bachelor|26.763157894736842|              3.0| 3.247105263157895| 24459.45945945946|
+---------+------------------+-----------------+------------------+------------------+

In [163]:
df.agg({'salary':'sum'}).show()

+-----------+
|sum(salary)|
+-----------+
|    2779000|
+-----------+